{"data":{"posts":{"edges":[{"node":{"id":"adc30cc7-cf86-504f-ab5e-6b218dd75468","html":"","frontmatter":{"path":"/my-mac-setup-2018-2","title":"My Mac Setup 2018: CLI Edition","date":"16 May 2018","keywords":null}}},{"node":{"id":"280728a1-f13c-5bec-9b5f-08db66ed8400","html":"","frontmatter":{"path":"/testing-with-jest","title":"Testing With Jest","date":"16 May 2018","keywords":null}}},{"node":{"id":"aa028197-9bf1-5bd3-a9ac-6807d1567993","html":"<p>Opening comments/blurb</p>\n<p>Logo\nLink to Extension</p>\n<p>Bit about the extension and why you use it</p>\n<p>Repeat above</p>","frontmatter":{"path":"/vs-code-plugins","title":"Vs Code Plugins","date":"25 Apr 2018","keywords":"vscode, editor, text editor, plugins, extensions, brackets, prettier, markdown, gitlens, git, syncing, jest"}}},{"node":{"id":"fe75a7e7-9fab-56be-863e-78ec94674dfc","html":"<p>We all have a process and a preference for how we do things. As with anything related to software development, or personal use, opinions abound and zealots form on all sides. I’m not saying that the applications I use in my day to day are what everyone should use, but after a significant amount of testing I’ve found them to be quite useful. They’ve become daily uses for me, and I hope some of them might prove useful to you as well.</p>\n<p><a href=\"https://brew.sh/\" title=\"Homebrew Homepage\">Homebrew</a></p>\n<p>If you didn’t know before, you can use brew to manage a lot more than just CLI tools. Brew Cask will install a wide range of products that are available online, the only caveat is if an application is only available on the App Store. In that case <a href=\"https://github.com/mas-cli/mas\" title=\"mas github repo\">Mac App Store CLI</a> can help with that. Mas is like brew, but for the App Store. You have to have already downloaded the app once from the store with your Apple ID, so it won’t work for the initial install, but it goes a decent way toward setting up a fresh MacBook. Personally, I find using brew to be faster than going to a site, downloading a tar, unpacking, and everything. Brew handles all of that for you, and the most important part wipes it all when you want to uninstall whatever app/package you installed. Adding/removing things from your PATH, the works.<br><br></p>\n<p><a href=\"http://www.bear-writer.com/\" title=\"Bear Homepage\">Bear</a></p>\n<p>I recently switched to Bear after having used Evernote for four years, and while I liked Evernote, I love Bear. For one, Bear is <strong>fast</strong> and looks fantastic, as one would expect since it was created by a design based company. It’s also fairly inexpensive for a premium subscription ($14.99 per year), even though it has a fully featured freemium model. The main thing free tier is missing is the ability to sync notes across devices and to unlock more themes.</p>\n<p>My <a href=\"https://www.codelyon.com/\" title=\"codelyon.com\">blog</a>, for example, is built using Hugo, a static site generator that uses Markdown to generate posts, which Bear is compatible with unlike Evernote. Having the ability to keep post ideas, daily lists, notes, and the posts themselves all in one location is super handy.<br><br></p>\n<p><a href=\"https://www.spectacleapp.com/\" title=\"Spectacle Homepage\">Spectacle</a></p>\n<p>One of the most annoying parts of MacOS, to me at least, is window management, more like the lack thereof. Coming from Windows I was used to the fancy drag to the side of the screen and the OS resizes the window to fit for me. I missed that when switching to Mac, and while Spectacle isn’t <em>quite</em> the same, it’s pretty damn close.</p>\n<p>Spectacle works via keyboard shortcuts, which is nice if you spend a <strong>lot</strong> of time using one. Open source, and completely free. You can resize to fill the full screen, center a window, halves, thirds, quarters. It’s quick, easy, and becomes second nature relatively quickly.<br><br></p>\n<p><a href=\"https://cordlessdog.com/stay/\" title=\"Stay Homepage\">Stay</a></p>\n<p>Another annoying thing about MacOS, and OS X before it, is the tendency for windows to disappear or be completely offscreen when using multiple displays. Unplugging from multiple screens, working on a single display, then plugging back into your multi-screen setup often results in desktop rearranging and missing windows. First world problems, I know, but sometimes you just want things to be how they were the last time you were using it. Stay “stores” your application windows for you, and will restore them when asked to. This way if you run into any of this window hiding BS, you can easily restore them without having to kill the application and restart it.<br><br></p>\n<p><a href=\"https://justgetflux.com/\" title=\"Flux Homepage\">f.lux</a></p>\n<p>I’m probably not the only one, but I tend to turn the brightness <strong>way</strong> down on my screens, MacBook and secondary screens. I’ve had problems in the past with headaches which I’ve attributed to a combination of bright screens and outdated glasses, though I typically only wear them while driving. Still, flux is intended to help with eye strain and filtering out the blue light that keeps our brains from getting tired at night. Obviously, this doesn’t work so well if you need to have color accuracy, but for the majority of my time, I have a slight yellow tinge to my display.<br><br></p>\n<p><a href=\"http://tomighty.org/\" title=\"Tomighty Page\">Tomighty</a></p>\n<p>Oh the mighty Pomodoro. Seriously, I’ve gotten more done since adopting this technique than I could have hoped for. Granted some days it’s easier than others to focus on tasks. I find that breaking things up into 25 min blocks is great, and Tomighty really helps out. With keyboard shortcuts and the tracking of how many I’ve completed, this is one of the first apps I install when setting up a new machine.<br><br></p>\n<p><a href=\"http://airmailapp.com/\" title=\"Airmail Homepage\">Airmail</a></p>\n<p>Personally, I find the default Mail app to be incredibly slow. I was introduced to Airmail by a former coworker, in the beginning, I really didn’t want to try it due to it not being a free solution. Being a broke college student at the time, I couldn't really justify it. However, I don’t think I’ll ever go back. With the ability to handle a significant amount of inboxes, smart folders, and automation rules to handle different types of mail, this client has everything I need in a sleek, fast package.<br><br></p>\n<p><a href=\"https://app.grammarly.com/\" title=\"Grammarly Homepage\">Grammarly</a></p>\n<p>I use the free version but have considered getting a subscription. I write enough and forget how to spell enough to justify it. The better part of this app is the grammar enhancement.<br><br></p>\n<p><a href=\"https://www.alfredapp.com/\" title=\"Alfred Homepage\">Alfred</a></p>\n<p>When I first discovered Spotlight I couldn’t believe it. I can open applications without having to open the finder, or the dock, or an icon on the desktop. I started reading and hearing about Alfred in articles and podcasts, so I knew I had to give it a shot. The free version is very powerful, the ability to open applications and files, search Google (or your browser of choice) with customizable hotkeys and extensibility was pretty awesome. I stuck with the free version for nearly a year before finally buying a license, workflows are what convinced me after reading about the <a href=\"http://devdocs.io/\" title=\"devdocs Homepage\">devdocs</a> integration. Now I have the ability to search offline documentation for nearly any language and/or framework. I’ve barely scratched the surface of what this tool can do, and could likely write an entire post on it alone.</p>","frontmatter":{"path":"/my-mac-setup-2018-1","title":"My Mac Setup 2018: GUI Edition","date":"28 Mar 2018","keywords":"homebrew, bear, spectacle, stay, flux, tomighty, pomodoro, window management, notetaking, markdown, package manager, macos, OSX, mac, Airmail, grammarly, alfred, spotlight, grammar, development, process, productivity"}}},{"node":{"id":"5894c79e-86ce-5cee-9358-64f2dfcdebbd","html":"<p>Every now and then you just need a good reference</p>\n<!--more-->\n<br>\n## Docker Machine\n<p>docker-machine commands aren't needed if using the GUI toolkit, but where's the fun in that?</p>\n<pre><code class=\"text\">docker-machine start - Start VM\n\ndocker-machine stop - Stop VM\n\ndocker-machine env - Display Docker client setup commands</code></pre>\n<br>\n## Docker\n<pre><code class=\"text\">docker - List Docker CLI commands\n\ndocker <command> --help - Get help on a specific command\n\ndocker pull <Name of Image> - Pull image from Docker Hub\n\ndocker images - Show all images\n\ndocker rmi <ImageID> - Remove specific images\n\ndocker ps -a - Show all containers based on Docker env config\n\ndocker rm <ContainerID> -Remove specific container\n\ndocker rm $(docker ps -a -q) Remove all containers\n\ndocker ps --format 'table {{.Names}}\\t{{.Image}}\\t{{.Status}}' - Formatted list of containers\n\ndocker run -d --name <Container Name> -p <External Port:Container Port> <Your Image> - Run a container in daemon mode bound to specified port\n\ndocker build -f <Your Dockerfile> -t <Tag Name> . - Build an image from a Dockerfile\n\ndocker login - Login using your Docker Hub credentials\n\ndocker push <Your Image Name> - Push an image to Docker hub</code></pre>\n<br>\n## Docker Compose\n<pre><code class=\"text\">docker-compose build - Build images based on docker-compose\n\ndocker-compose up -d - Start in daemon mode\n\ndocker-compose logs - Show logs from containers | useful in daemon mode\n\ndocker-compose up - Start containers based on docker-compose.yml\n\ndocker-compose up -d --no-deps --build <service_name> - Rebuild and deploy just the container that needs updating\n\ndocker-compose -f <Filepath> up - Start containers using docker-compose file in another directory\n\ndocker-compose stop - Stop containers but dont remove them\n\ndocker-compose down - Stop and remove containers | CTRL+C/CMD+C can also be used but this is safer</code></pre>","frontmatter":{"path":"/useful-docker-commands","title":"Useful Docker Commands","date":"21 Mar 2018","keywords":"docker, docker-compose, containers, containerization, cloud, vm, redis, microservices, developer, dev, development, software, convenience, article, blog post, blog"}}},{"node":{"id":"a1d385e4-9cec-544e-b610-46a12b655375","html":"<p>It seems appropriate to not only start this today, but to use this title. Since my son Mason has said his own “Hello, world!” today. Obviously being a newborn he can’t speak yet but he’s at the beginning of his journey. Much like we all were at one point or another, and with each new thing we learn, continue that journey into a new realm.</p>\n<p>I remember writing my first program as a kid, and by program it was just “Hello, world!” printed to the screen. (Likely followed shortly by something much more crude) It was so gratifying to make that happen, even though looking back it’s trivial compared to what I’ve learned to do since. Originally my goal was to create games, and I did for a bit. I’m still upset with myself that I didn’t keep copies of those text adventure games, as terrible as they were it would have been great to go back and look them over now. A benchmark of a much younger me, a stranger at this point.</p>\n<p>My plan for this site is to write about what I’m building, what and how I’m learning as I go. A reflective look at things, a place to store them, and a way to help others if they stumble upon a post as I’ve been thankful enough to others for doing so for years.</p>","frontmatter":{"path":"/hello-world","title":"Hello, world!","date":"08 Dec 2017","keywords":"hello, world, first post, beginner, newborn, son, journey"}}}]}}}